InformationRegisters/Чеки_СоответствиеТоваровИСтатей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<InformationRegister>
		<Properties>
			<Name>Чеки_СоответствиеТоваровИСтатей</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Статья</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатьиРасходов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Товар</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДополнительныеЗначенияВидовАналитик</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/Чеки_СоответствиеТоваровИСтатей/Ext/ManagerModule.bsl
Процедура ДополнитьСоответствие(Статья, Товар) Экспорт
	Менеджер = РегистрыСведений.Чеки_СоответствиеТоваровИСтатей.СоздатьМенеджерЗаписи();
	Менеджер.Товар = Товар;
	Менеджер.Прочитать();
	
	Если Менеджер.Выбран()
		И Менеджер.Статья = Статья Тогда
			Возврат;
	КонецЕсли;
	
	Менеджер.Товар = Товар;
	Менеджер.Статья = Статья;
	
	Менеджер.Записать(Истина);
КонецПроцедуры

Функция ПолучитьСтатьюПоТовару(Товар) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	Чеки_СоответствиеТоваровИСтатей.Статья КАК Статья
	               |ИЗ
	               |	РегистрСведений.Чеки_СоответствиеТоваровИСтатей КАК Чеки_СоответствиеТоваровИСтатей
	               |ГДЕ
	               |	Чеки_СоответствиеТоваровИСтатей.Товар = &Товар";
	Запрос.УстановитьПараметр("Товар",Товар);
	Результат = Запрос.Выполнить();
	Если Результат.Пустой() Тогда 
		Возврат Неопределено;
	КонецЕсли;
	
	Выборка = Результат.Выбрать();
	Выборка.Следующий();
	Возврат Выборка.Статья;
КонецФункции
